---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndLevelReference
source: html/776fd8d3-cfe3-87c2-ab26-5a88890c40fc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndLevelReference Property

"End Attachment Level Reference"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentEndLevelReference { get; }
```